Tekla Open API Reference for Tekla Structures 2025
Dialogs.LoadAttributeFileNameToDialogAndApply Method (String)
 Uses the attributes found from the attribute file as the applied values for the specified dialog.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static int LoadAttributeFileNameToDialogAndApply(
	string param
)
Public Shared Function LoadAttributeFileNameToDialogAndApply (
	param As String
) As Integer
Parameters
param
Type: System.String
Not used.
Return Value
Type: Int32
0 always. The return value is not useful because it is not sent to the Tekla Structures core.
See Also
Reference
Dialogs Class
LoadAttributeFileNameToDialogAndApply Overload
Tekla.Structures.Dialog Namespace